// 1 завдання*********

// Робота зі змінними
// Оголосіть дві змінні: name та city.
// Присвойте значення "Іван" змінній name.
// Скопіюйте значення зі змінної name в city.
// Виведіть значення змінної city, використовуючи функцію console.log (яка повинна показати “Іван”).

// let name = 'Іван';
// let city = 'Kyiv';
// city = name;
// console.log(city)

// Кінець 1 завдання //

// 2 завдання*********

//Який буде результат виконання скрипта?
// let name = "Olga";
// console.log(`привіт ${1}`); // привіт 1
// console.log(`привіт ${"name"}`); // привіт name
// console.log(`привіт ${name}`); // привіт Ольга

// Кінець 2 завдання //

// 3 завдання*********

//Видобути число зі змінних
// let a = "5";
// let b = "13cvb";
// let c = "12.9sxdcfgv";
// вивести в консоль тип
// console.log(typeof Number(a))
// console.log(typeof parseInt(b))
// console.log(typeof parseFloat(c))

// Кінець 3 завдання //

// 4 завдання***********

//Зробіть, щоб 0.1 + 0.2 = 0.3
// console.log((0.1 * 10 + 0.2 * 10) / 10);

// Кінець 4 завдання //

// 5 завдання******

//Поверніть найбільше число с набору 20, 10, 50, 40
// console.log(Math.max(20, 10, 50, 40));

// Кінець 5 завдання //

// 6 завдання*********

//Поверніть випадкове число в діапазоні від 2 до 4
// console.log(Math.random() * (4 - 2) + 2);

// Кінець 6 завдання //

// 7 завдання

//дізнатись довжину message
// const message = "Welcome to Bahamas!";
// console.log(message.length) // 19

// Кінець 7 завдання //

// 8 завдання

//вивести в консоль message великими літерами
// console.log(message.toUpperCase());

// Кінець 8 завдання //

// 9 завдання

// створити пустий об*єкт
// додати туди ім*я, вік і місто
// вивести результат в консоль
// видалити місто
// додати буль з ключем: like flowers
// вивести результат в консоль

// let user = {};
// user.name = "Maksym";
// user.age = 38;
// user.city = "Kyiv";
// // console.log(user);
// delete user.city;
// user['like flowers'] = true;
// console.log(user);

// Кінець 9 завдання //

// 10 завдання

// За допомогою циклу “for…in” вивести в консоль ключі і значення об*єкта

// for (key in user) {
//   console.log(key);
//   console.log(user[key]);
// }

// Кінець 10 завдання //